SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( Simplex2028nocabNG
    Type ( Engine )
    WagonShape ( simplex2028nocabng.s )
    
    Size  ( 1.6m 1.369483m 2.41471m )
    CentreOfGravity ( 0m 0.6847416m 0m )
    Mass       ( 2.5t )
    WheelRadius ( 0.3100001m )
    InertiaTensor ( Box ( 1.6m 1.369483m 2.41471m  ) )
    Coupling (
        Type ( Chain )
        Spring (
            Stiffness ( 1e6N/m 2e6N/m )
            Damping ( 1e6N/m 1e6N/m )
            Break ( 3.2e6N 3.2e6N )
            r0 ( 20cm 40cm )
        )
    )
    Buffers (
        Spring (
            Stiffness ( 1e6N/m 5e6N/m )
            Damping ( 1e6N/m/s 1e6N/m/s )
            r0 ( 0m 1e9 )
        )
        Centre ( 0.5 )
        Radius ( 1 )
        Angle ( 0.5deg )
    )

    Adheasion ( 0.2 0.4 2 0 )
    DerailRailHeight ( 4cm )
    DerailRailForce ( 2.5*155t )
    DerailBufferForce ( 500kN )
    NumWheels ( 4 )
    Friction (
        100N/m/s        1        -1mph        0        1
        5.1N/rad/s        1        -1rad/s        0        1
    )

    AntiSlip ()

    BrakeEquipmentType( "Triple_valve, Auxilary_reservoir, Emergency_brake_reservoir" )

    BrakeSystemType( "Air_single_pipe" )
    MaxBrakeForce( 140kN )

    EmergencyBrakeResMaxPressure( 110 )
    TripleValveRatio( 2.5 )
    MaxReleaseRate( 40 )
    MaxApplicationRate( 40 )
    MaxAuxilaryChargingRate( 35 )
    EmergencyResCapacity( 10 )
    EmergencyResChargingRate( 30 )
    BrakeCylinderPressureForMaxBrakeBrakeForce( 70 )


    Sound (    "simplex2028nocabngeng.sms" )
)

Engine ( Simplex2028nocabNG

    Effects
    (
        DieselSpecialEffects
        (
        )
    )

    Wagon ( Simplex2028nocabNG )
    Type ( Diesel )
    MaxPower ( 20hp )
    MaxForce ( 5000lbf )
    MaxContinuousForce ( 3000lbf )
    RunUpTimeToMaxForce ( 30.0 )
    MaxDieselLevel( 10gal ) 

    MaxVelocity              ( 12.5mph )
    MaxCurrent ( 1800A )
    WheelRadius ( 0.3100001m )
    Sanding ( 6mph )
    NumWheels ( 4 )
    MaxTemperature ( 120 )
    MaxOilPressure ( 90 )

    AirBrakesAirCompressorPowerRating( 1.7 )
    AirBrakesMainMinResAirPressure( 0 )
    AirBrakesMainMaxAirPressure( 130 )
    AirBrakesMainResVolume( 8 )
    AirBrakesAirCompressorWattage( 19000 )
    AirBrakesCompressorRestartPressure( 125 )
    AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.27 )
    AirBrakesHasLowPressureTest( 1 )
    AirBrakesIsCompressorElectricOrMechanical( 1 )

    EngineBrakesControllerMinPressureReduction( 6 )
    TrainBrakesControllerMinPressureReduction( 6 )
    EngineBrakesControllerHasProportionalBrake( 1 )
    EngineBrakesProportionalBrakeLag( 0.9 )
    EngineBrakesControllerMaxApplicationRate( 20 )
    TrainBrakesControllerMaxApplicationRate( 10 )
    EngineBrakesControllerMaxReleaseRate( 20 )
    TrainBrakesControllerMaxReleaseRate( 4 )
    EngineBrakesControllerEmergencyApplicationRate( 50 )
    TrainBrakesControllerEmergencyApplicationRate( 50 )
    EngineBrakesControllerMinSystemPressure( 0 )
    TrainBrakesControllerMinSystemPressure( 0 )
    EngineBrakesControllerMaxSystemPressure( 90 )
    TrainBrakesControllerMaxSystemPressure( 90 )
    EngineBrakesControllerEmergencyBrakeTimePenalty( 0 )
    TrainBrakesControllerEmergencyBrakeTimePenalty( 0 )
    EngineBrakesControllerFullServicePressureDrop( 26 )
    TrainBrakesControllerFullServicePressureDrop( 26 )

    
    BrakesEngineBrakeType( "Air_single_pipe"  )
    BrakesTrainBrakeType( "Air_single_pipe" )
      BrakesEngineControllers( "Independent, Train
" )

    EngineBrakesControllerDirectControlExponent( 1 )
    
    CabView ( simplex2028nocabng.cvf )
    MaxDieselLevel ( 10gal )
    DieselUsedPerHourAtMaxPower ( 0.3gal )
    DieselUsedPerHourAtIdle ( 0.1gal )

    DieselSmokeEffectInitialMagnitude( 2.2 )
    DieselSmokeEffectMaxMagnitude( 2.2 )
    DieselSmokeEffectInitialSmokeRate( 0.2 )
    DieselSmokeEffectMaxSmokeRate( 10 )

    DieselEngineIdleRPM( 215 )
    DieselEngineMaxRPM( 900 )
    DieselEngineSpeedOfMaxTractiveEffort( 13mph )
    DieselEngineMaxRPMChangeRate( 40 )

    DoesHornTriggerBell( 0 )
    
    MaxSandingTime( -1 )
     EngineControllers (
        Throttle ( 0 1 0.125 0 
            NumNotches ( 9
              Notch ( 0     0 Dummy )
              Notch ( 0.125   0 Dummy )
              Notch ( 0.25    0 Dummy )
              Notch ( 0.375   0 Dummy )
              Notch ( 0.5     0 Dummy )
              Notch ( 0.625   0 Dummy )
              Notch ( 0.75    0 Dummy )
              Notch ( 0.875   0 Dummy )
              Notch ( 1     0 Dummy )
            )
        )
        Brake_Engine ( 0 1 0.0125 0 
            NumNotches ( 1
              Notch ( 0     1 Dummy )              
            )
        )
        Brake_Train ( 0 1 0.0125 0.75 
            NumNotches ( 5
              Notch ( 0    0 TrainBrakesControllerReleaseStart )
              Notch ( 0.3  1 TrainBrakesControllerGraduatedSelfLapLimitedStart )
              Notch ( 0.85 0 TrainBrakesControllerSuppressionStart )
              Notch ( 0.9  0 TrainBrakesControllerContinuousServiceStart )
              Notch ( 0.95 0 TrainBrakesControllerEmergencyStart )
            )
        )
        
       
      )

    EngineVariables ( 10 )
     Sound (    "simplex2028nocabngcab.sms" )
     Name ( "Simplex2028nocabNG" )
    Description (
        "The Simplex was used in large numbers by small industries and the MOD.\n"+
        "This version is to 2` 6" gauge and has no cab\n"+
        "Diesel Engine Dorman 2hw\n"+
        " \n"
    )
    EngineOperatingProcedures (
        "The operating procedures for the engine.\n"+
        "\n"+
        " \n"
    )

)
